# Task 4
# Программа принимает действительное положительное число x и целое отрицательное число y. Необходимо выполнить
# возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y). При решении задания
# необходимо обойтись без встроенной функции возведения числа в степень. Подсказка: попробуйте решить задачу двумя
# способами. Первый — возведение в степень с помощью оператора **. Второй — более сложная реализация без оператора
# **, предусматривающая использование цикла.

def my_func(x, y):
    return x ** y


print(my_func(4, -3))

def my_func2(x, y):
    n = x
    for i in range((y * (-1)) -1):
        n *= x

    return (1/n)

print(my_func2(4, -3))

